{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_regularizer": null, "activation": "relu", "b_constraint": null, "init": "glorot_uniform", "name": "convolution2d_1", "nb_filter": 32, "bias": true, "dim_ordering": "tf", "W_constraint": null, "batch_input_shape": [null, 160, 320, 3], "trainable": true, "activity_regularizer": null, "border_mode": "valid", "b_regularizer": null, "input_dtype": "float32", "nb_row": 3, "nb_col": 3, "subsample": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "axis": -1, "name": "batchnormalization_1", "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "pool_size": [3, 3], "strides": [3, 3], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_1"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "activation": "relu", "b_constraint": null, "init": "glorot_uniform", "name": "convolution2d_2", "nb_filter": 64, "bias": true, "dim_ordering": "tf", "W_constraint": null, "activity_regularizer": null, "trainable": true, "border_mode": "valid", "b_regularizer": null, "nb_row": 3, "nb_col": 3, "subsample": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "axis": -1, "name": "batchnormalization_2", "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "pool_size": [3, 3], "strides": [3, 3], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_2"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "activation": "relu", "b_constraint": null, "init": "glorot_uniform", "name": "convolution2d_3", "nb_filter": 128, "bias": true, "dim_ordering": "tf", "W_constraint": null, "activity_regularizer": null, "trainable": true, "border_mode": "valid", "b_regularizer": null, "nb_row": 3, "nb_col": 3, "subsample": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "axis": -1, "name": "batchnormalization_3", "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_3"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "activation": "relu", "b_constraint": null, "init": "glorot_uniform", "name": "convolution2d_4", "nb_filter": 256, "bias": true, "dim_ordering": "tf", "W_constraint": null, "activity_regularizer": null, "trainable": true, "border_mode": "valid", "b_regularizer": null, "nb_row": 3, "nb_col": 3, "subsample": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "axis": -1, "name": "batchnormalization_4", "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_4"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": 3584, "b_constraint": null, "init": "glorot_uniform", "name": "dense_1", "bias": true, "W_regularizer": null, "W_constraint": null, "activation": "relu", "trainable": true, "b_regularizer": null, "output_dim": 1024}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "axis": -1, "name": "batchnormalization_5", "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": 1024, "b_constraint": null, "init": "glorot_uniform", "name": "dense_2", "bias": true, "W_regularizer": null, "W_constraint": null, "activation": "relu", "trainable": true, "b_regularizer": null, "output_dim": 256}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "axis": -1, "name": "batchnormalization_6", "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.75}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": 256, "b_constraint": null, "init": "glorot_uniform", "name": "dense_3", "bias": true, "W_regularizer": null, "W_constraint": null, "activation": "linear", "trainable": true, "b_regularizer": null, "output_dim": 1}}]}