{"config": [{"config": {"b_constraint": null, "dim_ordering": "tf", "nb_row": 3, "nb_col": 3, "trainable": true, "bias": true, "nb_filter": 32, "activation": "relu", "batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "W_constraint": null, "activity_regularizer": null, "name": "convolution2d_1", "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "valid", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"mode": 0, "epsilon": 0.001, "momentum": 0.99, "name": "batchnormalization_1", "trainable": true, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"dim_ordering": "tf", "trainable": true, "border_mode": "valid", "pool_size": [3, 3], "strides": [3, 3], "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"b_constraint": null, "dim_ordering": "tf", "nb_row": 3, "nb_col": 3, "trainable": true, "bias": true, "nb_filter": 64, "activation": "relu", "name": "convolution2d_2", "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "valid", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"mode": 0, "epsilon": 0.001, "momentum": 0.99, "name": "batchnormalization_2", "trainable": true, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"dim_ordering": "tf", "trainable": true, "border_mode": "valid", "pool_size": [3, 3], "strides": [3, 3], "name": "maxpooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"b_constraint": null, "dim_ordering": "tf", "nb_row": 3, "nb_col": 3, "trainable": true, "bias": true, "nb_filter": 128, "activation": "relu", "name": "convolution2d_3", "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "valid", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"mode": 0, "epsilon": 0.001, "momentum": 0.99, "name": "batchnormalization_3", "trainable": true, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"dim_ordering": "tf", "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"b_constraint": null, "dim_ordering": "tf", "nb_row": 3, "nb_col": 3, "trainable": true, "bias": true, "nb_filter": 256, "activation": "relu", "name": "convolution2d_4", "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "valid", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"mode": 0, "epsilon": 0.001, "momentum": 0.99, "name": "batchnormalization_4", "trainable": true, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"dim_ordering": "tf", "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_4"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "input_dim": 3584, "activity_regularizer": null, "trainable": true, "activation": "relu", "name": "dense_1", "output_dim": 1024, "W_constraint": null, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"mode": 0, "epsilon": 0.001, "momentum": 0.99, "name": "batchnormalization_5", "trainable": true, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"b_constraint": null, "input_dim": 1024, "activity_regularizer": null, "trainable": true, "activation": "relu", "name": "dense_2", "output_dim": 256, "W_constraint": null, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"mode": 0, "epsilon": 0.001, "momentum": 0.99, "name": "batchnormalization_6", "trainable": true, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "input_dim": 256, "activity_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_3", "output_dim": 1, "W_constraint": null, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}