{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "nb_col": 3, "activation": "relu", "nb_filter": 32, "activity_regularizer": null, "b_constraint": null, "border_mode": "valid", "nb_row": 3, "init": "glorot_uniform", "W_constraint": null, "trainable": true, "bias": true, "batch_input_shape": [null, 160, 320, 3], "dim_ordering": "tf", "W_regularizer": null, "input_dtype": "float32", "b_regularizer": null, "subsample": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_1", "mode": 0, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "axis": -1, "epsilon": 0.001}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "dim_ordering": "tf", "strides": [3, 3], "border_mode": "valid", "pool_size": [3, 3]}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "nb_col": 3, "nb_filter": 64, "activity_regularizer": null, "b_constraint": null, "border_mode": "valid", "W_constraint": null, "init": "glorot_uniform", "nb_row": 3, "trainable": true, "bias": true, "dim_ordering": "tf", "W_regularizer": null, "activation": "relu", "b_regularizer": null, "subsample": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_2", "mode": 0, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "axis": -1, "epsilon": 0.001}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "dim_ordering": "tf", "strides": [3, 3], "border_mode": "valid", "pool_size": [3, 3]}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "nb_col": 3, "nb_filter": 128, "activity_regularizer": null, "b_constraint": null, "border_mode": "valid", "W_constraint": null, "init": "glorot_uniform", "nb_row": 3, "trainable": true, "bias": true, "dim_ordering": "tf", "W_regularizer": null, "activation": "relu", "b_regularizer": null, "subsample": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_3", "mode": 0, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "axis": -1, "epsilon": 0.001}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "nb_col": 3, "nb_filter": 256, "activity_regularizer": null, "b_constraint": null, "border_mode": "valid", "W_constraint": null, "init": "glorot_uniform", "nb_row": 3, "trainable": true, "bias": true, "dim_ordering": "tf", "W_regularizer": null, "activation": "relu", "b_regularizer": null, "subsample": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_4", "mode": 0, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "axis": -1, "epsilon": 0.001}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_4", "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "input_dim": 3584, "activity_regularizer": null, "output_dim": 1024, "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "trainable": true, "bias": true, "W_regularizer": null, "activation": "relu", "b_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_5", "mode": 0, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "axis": -1, "epsilon": 0.001}}, {"class_name": "Dense", "config": {"name": "dense_2", "input_dim": 1024, "activity_regularizer": null, "output_dim": 256, "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "trainable": true, "bias": true, "W_regularizer": null, "activation": "relu", "b_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_6", "mode": 0, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "axis": -1, "epsilon": 0.001}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.7, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "input_dim": 256, "activity_regularizer": null, "output_dim": 1, "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "trainable": true, "bias": true, "W_regularizer": null, "activation": "linear", "b_regularizer": null}}], "keras_version": "1.2.0"}