{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"b_constraint": null, "nb_row": 3, "nb_col": 3, "dim_ordering": "tf", "bias": true, "init": "glorot_uniform", "activation": "relu", "W_regularizer": null, "nb_filter": 32, "name": "convolution2d_1", "W_constraint": null, "batch_input_shape": [null, 160, 320, 3], "activity_regularizer": null, "trainable": true, "b_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "input_dtype": "float32"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dim_ordering": "tf", "strides": [3, 3], "border_mode": "valid", "name": "maxpooling2d_1", "pool_size": [3, 3]}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "nb_row": 3, "nb_col": 3, "dim_ordering": "tf", "bias": true, "init": "glorot_uniform", "activation": "relu", "W_regularizer": null, "nb_filter": 64, "name": "convolution2d_2", "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "subsample": [1, 1], "border_mode": "valid"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dim_ordering": "tf", "strides": [3, 3], "border_mode": "valid", "name": "maxpooling2d_2", "pool_size": [3, 3]}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "nb_row": 3, "nb_col": 3, "dim_ordering": "tf", "bias": true, "init": "glorot_uniform", "activation": "relu", "W_regularizer": null, "nb_filter": 128, "name": "convolution2d_3", "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "subsample": [1, 1], "border_mode": "valid"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_3", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "nb_row": 3, "nb_col": 3, "dim_ordering": "tf", "bias": true, "init": "glorot_uniform", "activation": "relu", "W_regularizer": null, "nb_filter": 256, "name": "convolution2d_4", "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "subsample": [1, 1], "border_mode": "valid"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_4", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "activation": "relu", "W_regularizer": null, "W_constraint": null, "bias": true, "b_regularizer": null, "trainable": true, "input_dim": 3584, "output_dim": 1024, "name": "dense_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "activation": "relu", "W_regularizer": null, "W_constraint": null, "bias": true, "b_regularizer": null, "trainable": true, "input_dim": 1024, "output_dim": 256, "name": "dense_2"}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "W_constraint": null, "bias": true, "b_regularizer": null, "trainable": true, "input_dim": 256, "output_dim": 1, "name": "dense_3"}}]}