{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "b_regularizer": null, "W_constraint": null, "input_dtype": "float32", "dim_ordering": "tf", "subsample": [1, 1], "trainable": true, "nb_filter": 32, "nb_col": 3, "W_regularizer": null, "bias": true, "init": "glorot_uniform", "nb_row": 3, "activity_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "activation": "relu", "b_constraint": null, "border_mode": "valid"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "pool_size": [3, 3], "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "strides": [3, 3]}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "trainable": true, "nb_filter": 64, "activity_regularizer": null, "nb_col": 3, "W_regularizer": null, "bias": true, "border_mode": "valid", "nb_row": 3, "dim_ordering": "tf", "activation": "relu", "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "pool_size": [3, 3], "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "strides": [3, 3]}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "trainable": true, "nb_filter": 128, "activity_regularizer": null, "nb_col": 3, "W_regularizer": null, "bias": true, "border_mode": "valid", "nb_row": 3, "dim_ordering": "tf", "activation": "relu", "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "trainable": true, "nb_filter": 256, "activity_regularizer": null, "nb_col": 3, "W_regularizer": null, "bias": true, "border_mode": "valid", "nb_row": 3, "dim_ordering": "tf", "activation": "relu", "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_4", "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "input_dim": 3584, "W_constraint": null, "W_regularizer": null, "bias": true, "activation": "relu", "output_dim": 1024, "b_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "input_dim": 1024, "W_constraint": null, "W_regularizer": null, "bias": true, "activation": "relu", "output_dim": 256, "b_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "input_dim": 256, "W_constraint": null, "W_regularizer": null, "bias": true, "activation": "linear", "output_dim": 1, "b_constraint": null}}], "keras_version": "1.2.0"}